"""
TASK #1

Світлана замовляє чашки для співробітників, на яких мають бути надруковані імена.
Напишіть будь ласка функцію, що приймає на вхід список людей, у якому кожна людина описана як словник  ключами “name”, “surname”.
А повертає структуру з іменами і кількістю чашок які потрібно замовити.
"""
from collections import Counter
test_list = [{'name': 'Alex', 'surname':'Liakhov'}, { 'name': 'Micola', 'surname' :'Liakhov1'}, { 'name': 'Alex', 'surname' :'Micola'}]
def NameCounter (var):
    names = []
    for i in var:
         names.append(i['name'])
    all = dict(Counter(names))
    all['Number of all cups'] = len (names)

    return all

# print(NameCounter(test_list))

"""
Написать метод который принимет два числа a, b и возвращает все числа Фибоначчи на отрезке [a, b]
"""
def Fibonachi (a, b):


"""
получить список всех нечётных чисел от 0 до 100
со звёздочкой - сделайте это в одну строку
"""
# a = [ i for i in range(0, 100) if i%2 == 1]
# print (a)

"""
напишите метод, который принимает на вход два параметра: a и b
если тип обоих переменных (a и b) - int, вывести большее из них
если тип обоих переменных строка - сообщить, является ли строка b подстрокой строки a
если переменные разного типа, вывести сообщение об ошибке (любое)
"""
"""
Напишіть функцію, яка приймає на вхід три параметри: початковий рік (a), кінцевий рік (b),
список років (c). Функція має попертати список високосних років між а і b, крім вказаних у c
"""
