"""Задачки:"""

taks1_1 = """1. Получить список всех нечётных чисел на отрезке [a, b]."""
taks1_2 = """2. Получить список всех чисел Фибоначчи на отрезке [a, b]."""
taks1_3 = """3. Напишите функцию, которая принимает на вход два параметра: a и b.
 - если тип обоих переменных (a и b) - int, вывести большее из них
 - если тип обоих переменных строка - сообщить, является ли строка b подстрокой строки a
 - если переменные разного типа, вывести сообщение об ошибке (любое)"""
tasks1_4 = """4. Напишите функцию, которая принимает на вход три параметра: начальный год (a), конечный год (b), список годов (c). функцию должна вернуть список високосных лет между а і b, кроме тех которые указаны у списку c."""
tasks1_5 = """5. Найти сумму элементов массива."""
tasks1_6 = """6. Найти максимальный элемент, значение и индекс."""
tasks1_7 = """7. Найти минимальный элемент, значение и индекс."""
tasks1_8 = """8. Посчитать количество элементов больше нуля."""
tasks1_9 = """9. Прибавить к элементам массива их индекс."""
tasks1_10 = """10. Циклический сдвиг элементов массива на k- позиций вправо."""
tasks1_11 = """11. Вывести элементы одного массива, которые не равны элементам второго массива."""
tasks1_12 = """12. Из двух отсортированных массивов сделать третий отсортированный, не сортируя его."""

"""ООП"""

tasks2_1 = """1. Создать базовый клас который описывает геометрическую фигуру (можно абстрактный). Так же нужно создать класы которые описывают эллипс, круг, треугольник, равнобедренный треугольник, равносторонний треугольник, прямоугольник, квадрат. Все классы должны иметь методы вычисления площади и периметра."""
tasks2_2 = """2. Создать структуру данных типа дерево. Каждый узел дерева должен иметь строковое представление в виде "путь к вершине". Имплементировать методы который позволяют:
обходить дерево горизонтально и вертикально
добавлять элементы в дерево
делать вставку узла дерева.
выполнять поиск по атрибуту узла дерева"""

tasks2_3 = """3. Написать юнит тесты для кода из задачи про структуру данных типа дерево."""

 